# **Execute ETL**
Execute the Jupyter notebook step-by-step to create a comprehensive sales summary table from the original database tables, facilitating smoother and more efficient further analysis.

>### **Importing liabraries**

In [1]:
import pandas as pd

>### **Establishing Connection with MySQL Data-Base**

In [2]:
from sqlalchemy import create_engine

"""Connection Details"""

user = "root"  # your MySQL username
password = "tictok#2020"
host = "localhost"  # your MySQL server IP
port = "3306"
database = "contoso_sales"

try:
    engine = create_engine(
        f"mysql+pymysql://{user}:{password}@{host}:{port}/{database}"
    )
except Exception as exc:
    print("Error while connecting to mysql", exc)

>### **Execute ETL Process**

In [3]:
import sys

sys.path.append("../scripts")
from db_sql_etl_process import create_sales_summary

create_sales_summary(engine)

ETL Process is completed successfully

The above code invokes a custom function defined within the Python script, which is designed to execute the entire **ETL** process in a single run.

>### **Sample Output of Sales Summary Table**

In [4]:
sql_query = """
    SELECT * FROM sales_summary;
"""

df = pd.read_sql(sql=sql_query, con=engine)
df.head()

,id,dates,channel,brand,product_category,country,return_amount,discount_amount,total_cost,total_sales,net_sales,net_profit
0,1,2007-01-01,Store,Contoso,Audio,China,0.00,6.47,66.00,129.42,122.95,56.95
1,2,2007-01-01,Store,Contoso,Audio,United Kingdom,299.23,119.69,793.12,2393.84,1974.92,1181.80
2,3,2007-01-01,Store,Contoso,Audio,United States,0.00,14.96,892.26,2693.07,2678.11,1785.85
3,4,2007-01-01,Store,Wide World Importers,Audio,Romania,0.00,0.00,305.80,599.80,599.80,294.00
4,5,2007-01-01,Store,Wide World Importers,Audio,Slovenia,149.95,29.99,305.80,599.80,419.86,114.06